const fs = require("fs")
const chalk = require("chalk")

global.aay1 = `

*وَقَالَ لَهُمْ نَبِيُّهُمْ إِنَّ آيَةَ مُلْكِهِ أَنْ يَأْتِيَكُمُ التَّابُوتُ فِيهِ سَكِينَةٌ مِنْ رَبِّكُمْ وَبَقِيَّةٌ مِمَّا تَرَكَ آلُ مُوسَىٰ وَآلُ هَارُونَ تَحْمِلُهُ الْمَلَائِكَةُ ۚ إِنَّ فِي ذَٰلِكَ لَآيَةً لَكُمْ إِنْ كُنْتُمْ مُؤْمِنِينَ*
الآية [248] - سورة البقرة
`

global.aay2 = `

*ثُمَّ أَنْزَلَ اللَّهُ سَكِينَتَهُ عَلَىٰ رَسُولِهِ وَعَلَى الْمُؤْمِنِينَ وَأَنْزَلَ جُنُودًا لَمْ تَرَوْهَا وَعَذَّبَ الَّذِينَ كَفَرُوا ۚ وَذَٰلِكَ جَزَاءُ الْكَافِرِينَ*
الآية [26] - سورة التوبة
`

global.aay3 = `

*ثُمَّ أَنْزَلَ اللَّهُ سَكِينَتَهُ عَلَىٰ رَسُولِهِ وَعَلَى الْمُؤْمِنِينَ وَأَنْزَلَ جُنُودًا لَمْ تَرَوْهَا وَعَذَّبَ الَّذِينَ كَفَرُوا ۚ وَذَٰلِكَ جَزَاءُ الْكَافِرِينَ*
الآية [26] - سورة التوبة
`

global.aay4 = `

*إِلَّا تَنْصُرُوهُ فَقَدْ نَصَرَهُ اللَّهُ إِذْ أَخْرَجَهُ الَّذِينَ كَفَرُوا ثَانِيَ اثْنَيْنِ إِذْ هُمَا فِي الْغَارِ إِذْ يَقُولُ لِصَاحِبِهِ لَا تَحْزَنْ إِنَّ اللَّهَ مَعَنَا ۖ فَأَنْزَلَ اللَّهُ سَكِينَتَهُ عَلَيْهِ وَأَيَّدَهُ بِجُنُودٍ لَمْ تَرَوْهَا وَجَعَلَ كَلِمَةَ الَّذِينَ كَفَرُوا السُّفْلَىٰ ۗ وَكَلِمَةُ اللَّهِ هِيَ الْعُلْيَا ۗ وَاللَّهُ عَزِيزٌ حَكِيمٌ*
الآية [40] - سورة التوبة
`

global.aay5 = `

*هُوَ الَّذِي أَنْزَلَ السَّكِينَةَ فِي قُلُوبِ الْمُؤْمِنِينَ لِيَزْدَادُوا إِيمَانًا مَعَ إِيمَانِهِمْ ۗ وَلِلَّهِ جُنُودُ السَّمَاوَاتِ وَالْأَرْضِ ۚ وَكَانَ اللَّهُ عَلِيمًا حَكِيمًا*
الآية [4] - سورة الفتح
`

global.aay6 = `

*لَقَدْ رَضِيَ اللَّهُ عَنِ الْمُؤْمِنِينَ إِذْ يُبَايِعُونَكَ تَحْتَ الشَّجَرَةِ فَعَلِمَ مَا فِي قُلُوبِهِمْ فَأَنْزَلَ السَّكِينَةَ عَلَيْهِمْ وَأَثَابَهُمْ فَتْحًا قَرِيبًا*
الآية [18] - سورة الفتح
`

global.aay7 = `

*إِذْ جَعَلَ الَّذِينَ كَفَرُوا فِي قُلُوبِهِمُ الْحَمِيَّةَ حَمِيَّةَ الْجَاهِلِيَّةِ فَأَنْزَلَ اللَّهُ سَكِينَتَهُ عَلَىٰ رَسُولِهِ وَعَلَى الْمُؤْمِنِينَ وَأَلْزَمَهُمْ كَلِمَةَ التَّقْوَىٰ وَكَانُوا أَحَقَّ بِهَا وَأَهْلَهَا ۚ وَكَانَ اللَّهُ بِكُلِّ شَيْءٍ عَلِيمًا*
الآية [26] - سورة الفتح
`

global.aay8 = `

*اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ*
الآية [255] - سورة البقرة
`
/////////////////////
////////////////////
global.daa1 = `
*اللهم إني أعوذ بك من الهم والحزن والعجز والكسل والبخل والجبن وضلع الدين وغلبة الرجال*
`

global.daa2 = `

*ﺍﻟﻠﻬﻢ ﺍﺟﻌﻞ ﻟﻨﺎ ﻓﻲ ﻫﺬﺍ ﺍﻟﻴﻮﻡ ﺩﻋﻮﺓ ﻻ‌ﺗﺮﺩ… ﻭ أﻭﻫﺒﻨﺎ ﻓﻴﻪ ﺭﺯﻗﺎ ﻻ‌ ﻳﻌﺪ … ﻭﺍﻓﺘﺢ ﻟﻨﺎ ﺑﺎﺑﺎ ﻓﻲ ﺍﻟﺠﻨﺔ ﻻ‌ ﻳﺴﺪ… ﻭﺍﺣﺸﺮﻧﺎ ﻓﻲ ﺯﻣﺮﺓ ﺳﻴﺪﻧﺎ ﻣﺤﻤﺪ ﺻلى ﺍﻟﻠﻪ ﻋﻠﻴﻪ ﻭﺳﻠﻢ … ﺍﻟﻠهم ﺣﺒﺐ ﺧﻴﺮ ﺧﻠﻘﻚ ﻓﻴﻨﺎ.. ﻭﻣﻦ ﺣﻮﺽ ﻧﺒﻴﻚ ﺍﺳﻘﻴﻨﺎ … ﻭﻓﻲ ﺟﻨﺘﻚ ﺁﻭﻳﻨﺎ … ﻭﺑﺮﺣﻤﺘﻚ ﺍﺣﺘﻮﻳﻨﺎ… ﻭﺃﻣﻨﻴﺘﻨﺎ ﺃﻋﻄﻴﻨﺎ… ﻭﺑﻔﻀﻠﻚ ﺃﻏﻨﻴﻨﺎ ﻭﻟﻄﺎﻋﺘﻚ اهدنا … ﻭﻣﻦ ﻋﺬﺍﺏ ﺍﻟﻨﺎﺭ ﺍﺣﻤﻴﻨﺎ ﻭﻣﻦ ﺷﺮ ﻛﻞ ﺣﺎﺳﺪ ﺍﻛﻔﻴﻨﺎ.*
`

global.daa3 = `

*رب أعني ولا تعن عليّ، وانصرني ولا تنصر عليّ وامكر لي ولا تمكر عليّ وأهدني ويسر الهدي إليّ، وانصرني على من بغى عليّ رب اجعلني لك شاكرا لك ذاكرا، لك راهبا، لك مطواعاً إليك مخبتًا أوّاهاً منيباَ، رب تقبل توبتي، واغسل حوبتي، وأجب دعوتي وثبت حُجتي وأهد قلبي، وسدد لساني، و أسْلُلْ سخيمة قلبي.*
`
global.daa4 = `

*اللهم إنك تعلم أنهم أحباب قلبي، وأصحاب دربي ، فبلغهم مني كل الحب، وأدم إلهي بيننا حبل الود، واللهم ارزقنا وإياهم مغفرة بلا عذاب، وجنة بلا حساب ودعاء مستجاب.*
`
global.daa5 = `

*اللهم أرح قلبهم بلطف عفوك و حلاوة حبك، و أعمر أيامهم بذكرك، و أحفظهم و احفظ عليهم دينهم، وأسعد قلوبهم دائمًا.*
`
global.daa6 = `

*يا رب أحببته فيك، يا رب، احفظه عن معاصيك ، يا رب أجعل عمره فيما يرضيك، يا رب أكرمه يوم يلاقيك، يا رب ثبته في الدنيا على الدين، و أبعثه يوم الآخرة من أهل اليمين.*
`
global.daa7 = `

*اللهم اقبل صلاتها وأجب دعائها، وفرحها بسلامة أحبائه، وأظله بظل عرشك يوم لا ظل إلا ظلك، اللهم سخر لها القلوب، واحفظها من الكروب، وأسعدها ما تعاقب الشروق والغروب.*
`
global.daa8 = `

*اللَّهُمّ إنْي أَعَوْذ بِكَ مِنْ الْعَجْز وَالْكَسَل وَالْبُخْل وَالْهَرَم وَعَذَاب الْقَبْر اللَّهُمّ آت نَفْسِيَّ تَقْوَاهَا زَكّهَا أَنْتَ خَيْر مِنْ زَكَاهَا أَنْتَ وَلِيّهَا وَمَوْلَاهُ اللَّهُمّ إنْي أَعَوْذ بِكَ مَنْ عِلْم لَا يَنْفَع وَمِنْ قَلْب لَا يَخْشَع وَمِنْ نَفْسُ لَا تَشَبُّع وَمِنْ دَعْوَة لَا يُسْتَجَاب لَهَا. *
`
global.daa9 = `

*اللَّهُمّ إنْي أَسَأَلكَ الْعَافِيَة فِي الدُّنْيَا وَلِآخِرَة اللَّهُمّ مَتَّعنِي بِسُمْعِيٍّ وَبَصَري واجعلهما الْوَارِث مَنِّيٌّ وَاُنْصُرنِي عَلَى مَنْ يُظْلِمنِي وَخُذ مِنْهُ بِثَأْرِيِّ اللَّهُمّ أَعِنِّيِّ عِلِّيِّ ذِكْركَ وَشُكْركَ وَحُسْن عِبَادَتكَ اللَّهُمّ أَحْسَن عَاقِبَتنَا فِي الْأُمُور كُلَّهَا وَأَجْرنَا مِنْ خِزْي الدُّنْيَا وَعَذَاب الْآخِرَة. *
`
global.daa10 = `

*اللَّهُمّ إنْي أَسَأَلكَ عَيْشَة نِقْيَة وَمَيْتَة سَوِيَّة وَمَرَّدَا غَيْر مخزٍ وَلَا فَاضِح اللَّهُمّ قَنِعنِي بِمَا رَزَقَتنِي وِبَاركَ لِي فِيهُ وَاُخْلُف عُلِي كُلّ غَائِبَة لِي بِخَيْر اللَّهُمّ أَلْهَمنِي رَشَدِيٌّ وَأَعِذنِي مِنْ شَرّ نَفْسي.*
`
global.daa11 = `

*اللَّهُمّ حَاسَبنِي حِسَابَا يَسِيرَا اللَّهُمّ إنْي أَسَأَلكَ فَعَلًّ الْخَيْرَات وَتَرْك الْمُنْكِرَات حُبّ الْمَسَاكِين وَأَنْ تَغْفِر لِي وترحمني وَإِذَا أَرَدْت فِتْنَة قَوْم فَتُوفنِي غَيْر مَفْتُون وَأَسْأَلكَ حُبَك وَحَبّ مَنْ يُحَبِّك وَحُبّ عَمَل يَقْرَبنِي إِلَى حُبَك.*
`
global.daa12 = `

*الجمعة خير الأيام وأنتم خير الأحباب ، أدام الله بيننا المودة، ولكم من القلب أخلص الدعاء، ومن الجمعة نور وضاء، وأن تملأ حسناتكم ما بين الأرض والسماء.*
`
global.daa13 = `

*اللهم رحمتك أرجو فلا تكلني إلى نفسي طرفة عين، وأصلح لي شأني كله، لا إله إلا أنت.*
`
global.daa14 = `

*يا مقلب القلوب ثبت قلبي على دينك.*
`
global.daa15 = `

*اللَّهُمَّ اجْعَلْ في قَلْبِي نُورًا، وفي بَصَرِي نُورًا، وفي سَمْعِي نُورًا، وعَنْ يَمِينِي نُورًا، وعَنْ يَسارِي نُورًا، وفَوْقِي نُورًا، وتَحْتي نُورًا، وأَمامِي نُورًا، وخَلْفِي نُورًا، واجْعَلْ لي نُورًا.*
`
//////////////////////
/////////////////////
global.had1 = `

عَن أُمّ المُؤمنين عَائِشة رَضِيَ الله عنها قَالت:( أنَّ رَسولَ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ قَالَ: تَحَرَّوْا لَيْلَةَ القَدْرِ في الوِتْرِ مِنَ العَشْرِ الأوَاخِرِ مِن رَمَضَانَ.) 
المصدر : صحيح البخاري  
الصفحة أو الرقم : 2017
———————
شرح الحديث: 
ليلةُ القَدْرِ خيرٌ من ألْفِ شَهرٍ؛ فهي ليلةٌ من أشرفِ اللَّيالي، فيها تكونُ الحسناتُ مُضاعَفةً، وتُكفَّرُ فيها السيِّئاتُ، وهي ليلةٌ مُباركةٌ من ليالي رمضانَ؛ وسُمِّيتْ "ليلة القَدرِ"؛ لعَظيمِ قَدْرِها وشرَفِها. وقيلَ: لأنَّ للطاعاتِ فيها قدْرًا. وقيل غيرُ ذلك. ومِن حِكمةِ اللهِ تعالى أنَّه أَخْفاها عنِ الناسِ؛ لكي يجتَهِدوا في الْتِماسِها في الليالي، فيُكثِروا مِن العِبادةِ التي تعودُ عليهمْ بالنَّفعِ. 
وفي هذا الحديثِ تقولُ عائِشةُ رضي الله عنها: إنَّ رسولَ اللهِ صلَّى اللهُ عليهِ وسلَّم، قالَ: "تَحَرَّوْا"، أي: ابْذُلوا جُهدَكم وحِرصَكم في طلَبِ ليلةِ القدرِ، وهِي في الوَتْرِ، أي: في الليالي الوَتْريَّةِ، وهيَ: الحادِيةُ والعِشرونَ، والثالثةُ والعِشرونَ، والخامِسةُ والعِشرونَ، والسَّابعةُ والعِشرونَ، والتاسعة والعِشرونَ مِنَ العَشرِ الأَواخِرِ من رَمضانَ، وهيَ آخِرُ عَشَر ليالٍ مِن رمضانَ دُونَ أن تُحدَّدَ ليلةٌ بعَينِها. 
وفي الحديثِ: الحثُّ على تَحرِّي ليلةِ القَدْرِ واغتنامِها بالأعمالِ الصَّالحةِ؛ لِمَا فيها مِن زِيادةِ الفَضلِ والأَجرِ. 
مصدر شرح الحديث: الدّرر السّنيّة
`

global.had2 = `

عَن أَبي هُريرَة رَضِيَ الله عنْه أَنَّ رَسُول الله ﷺ قَال:( 
أَقْرَبُ ما يَكونُ العَبْدُ مِن رَبِّهِ، وهو ساجِدٌ، فأكْثِرُوا الدُّعاءَ.) 
المصدر : صحيح مسلم  
الصفحة أو الرقم : 482  
———————— 
شرح الحديث:  
الصَّلاة من أَجلِّ وأعظمِ العباداتِ التي يتقرَّبُ فيها العبدُ إلى اللهِ تعالى، وكلَّما ازدادَ تَواضُعُ العبدِ وخشوعُه زادَ قُربًا مِن الله، ووضْعُ الوجهِ والأنف في الأرض قمَّةُ التَّواضُع والتَّذلُل، وهنا يكون الدُّعاء من قلبٍ خاشع، ومُتواضِع لله فيكون أقربَ لاستجابةِ الدُّعاء، وفي هذا الحديث يقولُ النبيُّ صلَّى الله عليه وسلَّم أنَّه "أقربُ ما يكونُ العبدُ من ربِّه وهو ساجدٌ"، أي: أقربُ ما يكون العبدُ مِن الله سبحانه وتعالى في حالِ سجودِه؛ "فأكْثِروا الدُّعاءَ"، أي: فأكْثِروا الدُّعاء في وضْعِ السُّجودِ، فإنَّه أجدرُ أنْ يَستجيبَ اللهُ فيه الدُّعاء من العبدِ. 
وقدْ حثَّ النَّبيُّ صلَّى الله عليه وسلَّم على كثرةِ السُّجود والدُّعاء فيه في أحاديثَ أخرى. 
وفي الحديث: بيانُ مَوضِع من مواضِع الدُّعاء في الصَّلاة وهو السُّجودُ وبيانُ فَضْله. 
وفيه: الحثُّ على الإكثارِ من الدُّعاء في السُّجودِ. 
مصدر شرح الحديث: الدُّرر السَّنيّة
`

global.had3 = `

عَن أُمّ المُؤمنين عَائِشة رَضِيَ الله عنها قَالت:( أنَّ رَسولَ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ قَالَ: تَحَرَّوْا لَيْلَةَ القَدْرِ في الوِتْرِ مِنَ العَشْرِ الأوَاخِرِ مِن رَمَضَانَ.) 
المصدر : صحيح البخاري  
الصفحة أو الرقم : 2017 
——————— 
شرح الحديث:  
ليلةُ القَدْرِ خيرٌ من ألْفِ شَهرٍ؛ فهي ليلةٌ من أشرفِ اللَّيالي، فيها تكونُ الحسناتُ مُضاعَفةً، وتُكفَّرُ فيها السيِّئاتُ، وهي ليلةٌ مُباركةٌ من ليالي رمضانَ؛ وسُمِّيتْ "ليلة القَدرِ"؛ لعَظيمِ قَدْرِها وشرَفِها. وقيلَ: لأنَّ للطاعاتِ فيها قدْرًا. وقيل غيرُ ذلك. ومِن حِكمةِ اللهِ تعالى أنَّه أَخْفاها عنِ الناسِ؛ لكي يجتَهِدوا في الْتِماسِها في الليالي، فيُكثِروا مِن العِبادةِ التي تعودُ عليهمْ بالنَّفعِ. 
وفي هذا الحديثِ تقولُ عائِشةُ رضي الله عنها: إنَّ رسولَ اللهِ صلَّى اللهُ عليهِ وسلَّم، قالَ: "تَحَرَّوْا"، أي: ابْذُلوا جُهدَكم وحِرصَكم في طلَبِ ليلةِ القدرِ، وهِي في الوَتْرِ، أي: في الليالي الوَتْريَّةِ، وهيَ: الحادِيةُ والعِشرونَ، والثالثةُ والعِشرونَ، والخامِسةُ والعِشرونَ، والسَّابعةُ والعِشرونَ، والتاسعة والعِشرونَ مِنَ العَشرِ الأَواخِرِ من رَمضانَ، وهيَ آخِرُ عَشَر ليالٍ مِن رمضانَ دُونَ أن تُحدَّدَ ليلةٌ بعَينِها. 
وفي الحديثِ: الحثُّ على تَحرِّي ليلةِ القَدْرِ واغتنامِها بالأعمالِ الصَّالحةِ؛ لِمَا فيها مِن زِيادةِ الفَضلِ والأَجرِ. 
مصدر شرح الحديث: الدّرر السّنيّة
`

global.had4 = `

عَن أَبِي قتَادة الحَارِث بِن ربْعِي رَضِيَ الله عنه قال : ( 
بيْنَما نَحْنُ نُصَلِّي مع النبيِّ صَلَّى اللهُ عليه وسلَّمَ إذْ سَمِعَ جَلَبَةَ رِجَالٍ، فَلَمَّا صَلَّى قَالَ: ما شَأْنُكُمْ؟ قالوا: اسْتَعْجَلْنَا إلى الصَّلَاةِ؟ قَالَ: فلا تَفْعَلُوا إذَا أتَيْتُمُ الصَّلَاةَ فَعلَيْكُم بالسَّكِينَةِ، فَما أدْرَكْتُمْ فَصَلُّوا وما فَاتَكُمْ فأتِمُّوا.) 
المصدر : صحيح البخاري 
الصفحة أو الرقم: 635  
———————- 
شرح الحديث:  
لَمَّا كانتِ الصَّلاةُ لقاءً بيْن العبدِ وربِّه ناسَبَ ذلك أنْ يَستعِدَّ العَبدُ لهذا اللِّقاءِ، ويَتأدَّبَ بالأدَبِ اللَّازِمِ مع اللهِ سُبحانه وتَعالَى، وقد أرْشدَ النبيُّ صلَّى اللهُ عليه وسلَّمَ أُمَّتَه إلى كَثيرٍ مِن هذه الآدابِ، منها ما في هذا الحديثِ؛ فإنَّه صلَّى اللهُ عليه وسلَّمَ عندَما سمِعَ جَلَبَةَ رجالٍ، يعني: صَوتَ حَركتِهم وكَلامِهم، وهو يُصلِّي الجماعةَ، فسَأَلَهم بعدَما انْتَهى مِن صَلاتِه عن سَببِ هذه الحَرَكةِ والصَّوتِ، فقالوا: تَعجَّلْنا؛ لِنُدركَ الصَّلاةَ، فنَهاهم النبيُّ صلَّى اللهُ عليه وسلَّمَ عَن هذا الاستعجالِ، وأرشَدَهم إلى ما يَلزَمُهم مِن السَّكينةِ والوَقارِ عندَ قُدومِهم إلى الصَّلاةِ، وأمَرَهم بالهُدوءِ والتَّأنِّي، فما أدْركْتُم مع الإمامِ في صَلاتِه فَصلُّوه معه، وما فاتَكم مِن صَلاتِه فَأتِمُّوه بعدَ سَلامِ الإمامِ، وتُدرِكون بذلك أجْرَ الجَماعةِ فلا تَتعجَّلوا.وفي الحديثِ: الحثُّ على السَّكينةِ والوَقارِ عندَ الإتيانِ إلى الصَّلاةِ. 
مصدر شرح الحديث: الدّرر السّنيّة
`
global.had5 = `

عَن أَبي سَعِيدٍ الخُدَريّ رَضِيَ الله عنه قال : قَالَ رَسُولُ الله ﷺ:(يَدْخُلُ أهْلُ الجَنَّةِ الجَنَّةَ، وأَهْلُ النَّارِ النَّارَ، ثُمَّ يقولُ اللَّهُ تَعَالَى: أخْرِجُوا مِنَ النَّارِ مَن كانَ في قَلْبِهِ مِثْقَالُ حَبَّةٍ مِن خَرْدَلٍ مِن إيمَانٍ. فيُخْرَجُونَ منها قَدِ اسْوَدُّوا، فيُلْقَوْنَ في نَهَرِ الحَيَا، أوِ الحَيَاةِ - شَكَّ مَالِكٌ - فَيَنْبُتُونَ كما تَنْبُتُ الحِبَّةُ في جَانِبِ السَّيْلِ، ألَمْ تَرَ أنَّهَا تَخْرُجُ صَفْرَاءَ مُلْتَوِيَةً. قال وهيب: حدثنا عمرو (الحياة) وقال: (خردل من خير). 
المصدر : صحيح البخاري 
الصفحة أو الرقم: 22  
—————— 
شرح الحديث:  
تَفضَّلَ اللهُ سُبحانه على عِبادِه بنِعَمِه ورَحمتِه في الدُّنيا والآخِرةِ، وفي هذا الحديثِ يُبيِّنُ النبيُّ صلَّى اللهُ عليه وسلَّمَ بَعضَ ما يَتفضَّلُ اللهُ به عليهم في الآخِرةِ، فيُخبِرُ أنَّه بعدَما يَدخُلُ المؤمِنونَ مِن أهلِ الجنَّةِ الجنَّةَ بفضْلِ اللهِ ورَحمتِه، ثمَّ بسَببِ أعمالِهم الصَّالحةِ، وبعدَما يَدخُلُ أهلُ النَّارِ النَّارَ، فيَدخُلُ فيها كلُّ مَنِ استحَقَّ دُخولَها مِن أهلِ الإيمانِ وغَيرِهم؛ لمُجازاتِهم على سيِّئاتِهم -يَأمُرُ اللهُ مَلائكتَه أنْ يُخرِجوا مِن النَّارِ كلَّ مَن عمِلَ مِقدارَ حَبَّةِ خَردلٍ مِن أعمالِ الإيمانِ بعدَ التَّوحيدِ والتَّصديقِ بما جاء به نبيُّنا صلَّى اللهُ عليه وسلَّمَ. والخَردَلُ: نَباتٌ مَعروفٌ يُشبِهُ الشَّيءَ القَليلَ البليغَ في القِلَّةِ، وهو كِنايةٌ عن تَناهي العملِ في الصِّغَرِ.فيَخرُجونَ مِن النَّارِ قدِ اسوَدُّوا، أي: صارُوا سُودًا كالفَحْمِ مِن تَأثيرِ النَّارِ، فيُلقَوْنَ في نَهرِ الحَيَا، أو الحَياةِ، إشارةً إلى أنَّه سَببٌ في إحياءِ أجسامِ مَن خرَجَ مِنَ النارِ، فيَنبُتونَ كما تَنبُتُ البَذرةُ المَزروعةُ في جانبِ ماءِ السَّيلِ وتُربتِه، فيَنبُتُ نَباتُها في سُرعةٍ مع ضَعفٍ، فتَخرُجُ مِن الأرضِ عندَ بِدايتِها صَفراءَ اللَّونِ، جَميلةَ المنظَرِ، مُنعطِفةَ الأوراقِ، ثمَّ تَتمدَّدُ وتَتفتَّحُ أوراقُها بعدَ ذلك، وهذا ممَّا يَزيدُ الرَّياحِينَ حُسنًا.وهذا الحَديثُ نصٌّ في أنَّ الإيمانَ في القُلوبِ يَتفاضَلُ، وأنَّ أهلَ الإيمانِ يَتفاضَلون في درَجاتِ إيمانِهم. وفيه أيضًا: أنَّ مُرتكِبَ المعاصي مُعرَّضٌ للعُقوبةِ في الدَّارِ الآخِرةِ، ودُخولِ النَّارِ، إلَّا أنْ يَعفُوَ اللهُ عنه. 
مصدر شرح الحديث: الدّرر السّنيّة
`
global.had6 = `

عَنْ أَبِي سعِيدٍ الخُدَريّ رَضِيَ الله عنه قال :(إنَّ نَاسًا مِنَ الأنْصَارِ سَأَلُوا رَسولَ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ فأعْطَاهُمْ، ثُمَّ سَأَلُوهُ فأعْطَاهُمْ، ثُمَّ سَأَلُوهُ فأعْطَاهُمْ، حتَّى نَفِدَ ما عِنْدَهُ، فَقَالَ: ما يَكونُ عِندِي مِن خَيْرٍ فَلَنْ أدَّخِرَهُ عَنْكُمْ، ومَن يَسْتَعْفِفْ يُعِفَّهُ اللَّهُ، ومَن يَسْتَغْنِ يُغْنِهِ اللَّهُ، ومَن يَتَصَبَّرْ يُصَبِّرْهُ اللَّهُ، وما أُعْطِيَ أحَدٌ عَطَاءً خَيْرًا وأَوْسَعَ مِنَ الصَّبْرِ.) 
المصدر : صحيح البخاري  
الصفحة أو الرقم : 1469  
———————- 
شرح الحديث:  
كان رَسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ أجوَدَ بالخَيرِ مِن الرِّيحِ المُرسَلةِ، وكان يُعطِي عَطاءَ مَن لا يَخْشَى الفقْرَ، ومع سَعةِ إنفاقِه وُجودِه صلَّى اللهُ عليه وسلَّمَ كان يُربِّي النُّفوسَ على العَفافِ والاستغناءِ، وأنَّ ما عندَ اللهِ خَيرٌ وأبْقى. 
وفي هذا الحديثِ يَحكي أبو سَعيدٍ الخُدريُّ رَضيَ اللهُ عنه أنَّ ناسًا مِن الأنصارِ لم يُسَمِّهم سَأَلوا رَسولَ اللهِ صلَّى اللهُ عليه وسلَّمَ شَيئًا مِن المالِ فأعْطاهم، ثمَّ سَأَلوه فأعْطاهم، ثمَّ سَأَلوه فأَعْطاهم حتَّى نَفِدَ وانتَهى ما عِندَه مِن المالِ، فبيَّنَ لهم النبيُّ صلَّى اللهُ عليه وسلَّمَ أنَّه لا يَمنَعُ عنهم شيئًا مِن المالِ يكونُ عندَه فيَحتفَظ به لغَيرِهم. 
ثمَّ أرشَدَهُم صلَّى اللهُ عليْه وسلَّمَ وحَثَّهم على الاستِعفافِ؛ فمَن تَخلَّقَ بالعِفَّةِ عمَّا حَرَّمَ اللهُ عليْه -سَواءٌ في مَأكَلٍ، أو مَشرَبٍ، أو مَلبَسٍ، ونَحوِ ذلك- أعانَه اللهُ عليْها وحَصَلَتْ له، ثمَّ حثَّهم صلَّى اللهُ عليْه وسلَّمَ على الاستِغناءِ، وهو أنْ يُسْتَغْنى الإنسانُ عمَّا في أيْدي النَّاسِ، ويَستَغنيَ بما عِندَه مِن اليَسيرِ عن المَسأَلةِ، فلا يَسألُ إلَّا إذا كان مُضطَرًّا، ومَن يَفعَلْ ذلك يَمُدَّه اللهُ عزَّ وجلَّ بالغِنى مِن عِندِه، ويَجعَلِ القَليلَ في عَينِه كَثيرًا، ثمَّ حثَّ صلَّى اللهُ عليْه وسلَّمَ على الْتِزامِ الصَّبرِ وتَعويدِ النَّفسِ عليْه؛ لأنَّ الإنسانَ إذا صَبَرَ استَعفَفَ واستَغْنى، ولم يَحصُلْ منه السُّؤالُ والإلْحافُ في المَسأَلةِ. 
وقولُه: «ومَن يَتَصبَّرْ يُصَبِّرْه اللهُ»، أي: ومَن يُعالِجِ نفْسَه بالصَّبرِ ويَتَكلَّفْه على ضِيقِ العَيشِ وغَيرِه مِن مَكارِه الدُّنيا؛ يَملَأِ اللهُ قَلْبَه به، ومَن بَذَلَ الأسبابَ وحَرَصَ على الصَّبرِ؛ فإنَّ اللهَ تعالَى يُوفِّقُه لتَحصيلِه، ويَجعَلُه يَتَّصفُ به. 
ثمَّ بيَّن أنَّه ما أعْطَى اللهُ أحدًا نِعمةً ولا خُلُقًا كَريمًا أفضَلَ ولا أوسَعَ مِن الصَّبرِ؛ لأنَّه يَتَّسِعُ لكُلِّ الفَضائلِ، فكُلُّها تَصدُرُ عنه، وتَعتَمِدُ عليْه؛ مِن عِفَّةٍ، وشَجاعةٍ، وعَزيمةٍ، وإرادةٍ، وإباءٍ، وغَيرِها، والإنسانُ إذا كان صَبورًا تَحمَّلَ كُلَّ مَكروهٍ بإذْنِ اللهِ تعالَى. 
وفي الحَديثِ: أنَّ الأخلاقَ الكريمةَ يُمكِنُ اكتِسابُها والوصولُ إليها عن طَريقِ التعوُّدِ عليها. 
وفيه: ما كان عليه النبيُّ صلَّى اللهُ عليه وسلَّمَ مِن الكَرَمِ والسَّخاءِ والإيثارِ على نفْسِه. 
وفيه: الاعتِذارُ للسَّائلِ إذا لم يَجِدِ المسؤولُ ما يُعطِيه. 
وفيه: الحَضُّ على الاستِغناءِ عن النَّاسِ بالصَّبرِ، والتَّوكُّلِ على اللهِ، وانتظارِ رِزقِ اللهِ سُبحانَه، وأنَّ الصَّبرَ أفضلُ ما أُعطيَه المؤمنُ، وكذلك الجَزاءُ عليه غيرُ مُقدَّرٍ ولا مَحدودٍ. 
مصدر شرح الحديث: الدّرر السّنيّة
`
global.had7 = `


عن عبدالله بِن عبّاس رَضِيَ الله عنهُ أَنّ رَسُول الله ﷺ:  
(كانَ يقولُ في دعائِهِ ربِّ أعنِّي ولا تُعِنْ عليَّ، وانصُرني ولا تنصُرْ عليَّ، وامكُر لي ولا تَمكُر عليَّ، واهدِني ويسِّرِ الهدى لي، وانصُرني على من بغَى عليَّ، ربِّ اجعَلني لَكَ شَكَّارًا، لَكَ ذَكَّارًا، لَكَ رَهَّابًا، لَكَ مُطيعًا، إليكَ مُخبتًا، إليكَ أوَّاهًا مُنيبًا، ربِّ تقبَّل تَوبَتي، واغسِل حَوبَتي، وأجِب دعوَتي، واهدِ قلبي، وسدِّد لساني، وثبِّت حجَّتي واسلُلْ سَخيمةَ قلبي) 
المصدر : صحيح ابن ماجه 
الصفحة أو الرقم: 3103  
صحّحه الألباني رحمه الله  
———————- 
شرح الحديث:  
الدُّعاءُ والتَّذلُّلُ إلى اللهِ عزَّ وجلَّ بكلِّ ما يَليقُ بذاتِه مِن مَفاتيحِ تَفْريجِ الكُروبِ، وفيه يُظهِرُ العبدُ تَضرُّعَه وانقيادَه للهِ سبحانه؛ لعِلْمِه بأنَّه سبحانه هو القادرُ على إجابةِ دُعائِه. 
وفي هذا الحديثِ يُخبِرُ ابنُ عبَّاسٍ رَضِي اللهُ عنهما: أنَّ النَّبيَّ صلَّى اللهُ علَيه وسلَّم كان يقولُ في دُعائِه: "رَبِّ أعِنِّي"، أي: أطلُبُ مِنك العونَ، والتَّوفيقَ لطاعتِك، وعبادتِك على الوجهِ الأكملِ الَّذي يُرْضيك عنِّي, وأطلُبُ مِنك العونَ على جميعِ الأمورِ الدِّينيَّةِ والدُّنيَويَّةِ والأُخرَويَّةِ، وفي مُقابلةِ الأعداءِ أمِدَّني بمَعونتِك وتوفيقِك. 
"ولا تُعِنْ علَيَّ": ولا تَجعَلْ عونَك لِمَن يمنَعُني عن طاعتِك مِن النَّفْسِ الأمَّارةِ بالسُّوءِ، ومِن شَياطينِ الإنسِ والجِنِّ. "وانصُرْني"، وهذا طلَبٌ للنُّصْرةِ في كلِّ الأحوالِ، وقيل: مَعْناه: انصُرْني على نَفْسي الأمَّارةِ بالسُّوءِ؛ فإنَّها أَعْدى أعدائي، كما قال سبحانَه: {إِنَّ النَّفْسَ لَأَمَّارَةٌ بِالسُّوءِ إِلَّا مَا رَحِمَ رَبِّي} [يوسف: 53]، ولا مانِعَ مِن إرادةِ الجَميعِ؛ لأنَّه صلَّى اللهُ علَيه وسلَّم لم يُخصِّصْ نوعًا مُعيَّنًا. "ولا تَنصُرْ علَيَّ"، أيْ: ولا تَجعَلْني مَغلوبًا، فتُسلِّطْ علَيَّ أحَدًا مِن خَلقِك, ولا تَنصُرِ النَّفسَ الأمَّارَةَ بالسُّوءِ علَيَّ، فأتَّبِعَ الهَوى وأترُكَ الهُدى. 
"وامْكُرْ لي"، والْمَكْرُ هو الخِداعُ، وهو مِن اللهِ إيقاعُ بَلائِه بأعدائِه مِن حيثُ لا يَشعُرون في قابلة مكرهم، وهو صِفةُ كَمالٍ في حَقِّه تعالى، أي: أنزِلْ مَكْرَك بمَن أراد بي شَرًّا وسوءًا، وارزُقْني الحيلةَ السَّليمةَ، والطَّريقةَ الْمُثْلى في دَفْعِ كَيْدِ عدوِّي، فأَسْلَمَ مِن كَيدِهم وشَرِّهم. 
"ولا تَمكُرْ علَيَّ"، أي: ولا تَهْدِ عدُوِّي إلى طريقِ دَفْعِه إيَّاي عن نفسِه, ولا تُعامِلْني بسُوءِ نيَّتي، فأغتَرَّ وأتجاوَزَ الحَدَّ مِن حيثُ لا أشعُرُ فأَهلِكَ، والمكرُ مِن صفاتِ اللهِ تعالى الفِعليَّةِ المقيَّدةِ الَّتي تقَعُ بمَشيئتِه، فلا تُطلَقُ على اللهِ تعالى إلَّا في سبيلِ المقابَلةِ والجزاءِ لِمَن يَمكُرُ به تعالى وبأوليائِه. 
"واهْدِني"، أي: أرشِدْني ووَفِّقْني بالهدايةِ مِن عندِك، ولا أَزيغَ عنها حتَّى ألْقاك. "ويَسِّرِ الهُدى لي"، أي: سَهِّل لي اتِّباعَ الهدايةِ، وسُلوكَ طَريقِها، وهَيِّئْ لي أسبابَ الخيرِ، حتَّى لا أستَثقِلَ الطَّاعةَ، ولا أنشَغِلَ عن العبادةِ. 
"وانصُرْني على مَن بَغى علَيَّ"، أي: وانصُرْني على مَن ظلَمَني وتَعدَّى علَيَّ, وهذا تخصيصٌ بعدَ العُمومِ في قولِه أوَّلًا: "وانصُرْني ولا تَنصُرْ علَيَّ". 
ثُمَّ قال صلَّى الله عليه وسلَّم: "ربِّ اجعَلْني لك شَكَّارًا"، أي: كثيرَ الشُّكرِ في السَّرَّاءِ والضَّرَّاءِ، وفي القولِ والعمَلِ، وفي السِّرِّ، وفي العلَنِ، وفي تقديمِ الجارِّ والمجرورِ: "لك" دَلالةٌ على الاختِصاصِ، أي: أخُصُّك بالشُّكرِ؛ لأنَّك خالِقُ النِّعَمِ، ومُعْطيها، سأَل اللهَ التَّوفيقَ إلى الشُّكرِ؛ لأنَّ به تَدُومُ النِّعمُ. "لك ذَكَّارًا"، أي: كثيرَ الذِّكرِ لك في كلِّ الأوقاتِ والأحوالِ، وفي سُؤالِه تعالى التَّوفيقَ إلى الذِّكرِ؛ لأنَّه هو أفضلُ الأعمالِ. "لك رَهَّابًا"، أي: خائِفًا منك في كلِّ أحوالي. "لك مُطيعًا"، وفي روايةٍ: "لك مِطْواعًا"، أي: كثيرَ الطَّوْعِ، وهو الانقيادُ والامتِثالُ والطَّاعةُ لأوامِرِك، والبعدُ عن نَواهيك. "لك مُخبِتًا"، أي: كثيرَ الإخباتِ، وعلامَتُه: أن يَذِلَّ القلبُ بينَ يدَيِ اللهِ تعالى إجلالًا وتذَلُّلًا، أي: لك خاشِعًا متواضِعًا خاضِعًا. "إليك أوَّاهًا مُنيبًا"، والأوَّاهُ هو: كثيرُ التَّضرُّعِ والدُّعاءِ والبُكاءِ للهِ عزَّ وجلَّ، والمنيبُ كثيرُ الرُّجوع إلى اللهِ مِن الذُّنوبِ والخَطايا. "رَبِّ تقَبَّلْ توبَتي"، أي: اجعَلْها صَحيحةً بشَرائِطِها وآدابِها، وتَقبَّلْها منِّي. "واغسِلْ حَوبَتي"، أيِ: امْسَحْ ذَنبي وإثمي، وذَكَر الغَسْلَ لِيُفيدَ إزالتَه بالكُلِّيَّةِ. "وأجِبْ دَعْوتي"، أي: استَجِبْ كلَّ دُعائي. "وثَبِّتْ حُجَّتي"، أي: ثبِّتْ حُجَجي وبَراهيني في الدُّنيا على أعدائِك بالحجَّةِ الدَّامِغةِ، والدَّعوةِ، والأمرِ بالمعروفِ، و
النَّهيِ عن المنكَرِ بالأدلَّةِ البيِّناتِ السَّاطعةِ، وثبِّتْ قَولي في الآخرةِ عِندَ سُؤالِ الملَكَينِ في القَبْرِ، والحُججُ هي البيِّناتُ والدَّلائلُ. 
ثم خَتم صلَّى الله عليه وسلَّم دُعاءَه بقولِه: "واهْدِ قَلْبي"، أي: أرشِدْه ووفِّقْه إلى مَعرِفتِك، ومعرفةِ الحقِّ والهُدى والصِّراطِ المستقيم، "وسَدِّدْ لِساني"، أي: صَوِّبْ لِساني؛ حتَّى لا يَنطِقَ إلَّا بالحقِّ، ولا يَقولَ إلَّا الصِّدْقَ. "اسْلُلْ سَخيمةَ قَلْبي"، أي: أخرِجْ مِن قَلْبي: الحِقْدَ والغِلَّ، والحسدَ والغِشَّ. 
وفي الحديثِ: الدُّعاءُ بما فيه أسبابُ الصَّلاحِ والسَّعادةِ في الدُّنيا والآخِرَةِ. 
مصدر شرح الحديث: الدّرر السّنيّة
`
global.had8 = `

عَنْ أَبِي هُريرة رَضِيَ الله عنه قال : قَالَ رَسُولُ الله ﷺ:  
(إنَّ عَبْدًا أصابَ ذَنْبًا - ورُبَّما قالَ أذْنَبَ ذَنْبًا - فقالَ: رَبِّ أذْنَبْتُ - ورُبَّما قالَ: أصَبْتُ - فاغْفِرْ لِي، فقالَ رَبُّهُ: أعَلِمَ عَبْدِي أنَّ له رَبًّا يَغْفِرُ الذَّنْبَ ويَأْخُذُ بهِ؟ غَفَرْتُ لِعَبْدِي، ثُمَّ مَكَثَ ما شاءَ اللَّهُ ثُمَّ أصابَ ذَنْبًا، أوْ أذْنَبَ ذَنْبًا، فقالَ: رَبِّ أذْنَبْتُ - أوْ أصَبْتُ - آخَرَ، فاغْفِرْهُ فقالَ: أعَلِمَ عَبْدِي أنَّ له رَبًّا يَغْفِرُ الذَّنْبَ ويَأْخُذُ بهِ؟ غَفَرْتُ لِعَبْدِي، ثُمَّ مَكَثَ ما شاءَ اللَّهُ، ثُمَّ أذْنَبَ ذَنْبًا، ورُبَّما قالَ: أصابَ ذَنْبًا، قالَ: قالَ: رَبِّ أصَبْتُ - أوْ قالَ أذْنَبْتُ - آخَرَ، فاغْفِرْهُ لِي، فقالَ: أعَلِمَ عَبْدِي أنَّ له رَبًّا يَغْفِرُ الذَّنْبَ ويَأْخُذُ بهِ؟ غَفَرْتُ لِعَبْدِي ثَلاثًا، فَلْيَعْمَلْ ما شاءَ.) 
المصدر : صحيح البخاري  
الصفحة أو الرقم : 7507  
————————- 
شرح الحديث :  
اللهُ سُبحانَه وتعالَى رَحيمٌ بعِبادِه، وهو أرحمُ الرَّاحمينَ، ومِن رَحمتِه بعَبدِه أنَّه يَقبَلُ تَوبتَه كُلَّما عادَ إليه تائبًا، ولو تَكرَّر منه الذَّنبُ. 
وفي هذا الحديثِ يُخبِرُ النَّبيُّ صلَّى اللهُ عليه وسلَّم أنَّ عَبدًا من هذه الأُمَّةِ أو منَ الأُمَمِ السَّابِقةِ أذنَبَ ذَنبًا، ولكِنَّه تابَ من ذَنبِه هذا وأنابَ إلى اللهِ ورَجَع عنه واعتَرَفَ بخَطَئه، فنادى رَبَّه، فقالَ: رَبِّ أذنَبتُ -وربَّما قال: أصبتُ- ذَنبًا، فاغفِر لي، فجَعَل العَبدُ اعتِرافَه بالذَّنبِ سَبَبًا لطَلَبِ المَغفِرةِ منَ اللهِ؛ حيث عَلِم أنَّ اللهَ سُبحانَه أوجَبَ المَغفِرةَ للتَّائبين المُعتَرِفين بالسَّيِّئاتِ على سَبيلِ الوَعدِ إليه، فَيَسألُ اللهُ سُبحانه وتعالَى مَلائكَتَه وهو أعلمُ، فيَقولُ: «أَعَلِمَ عَبْدي أنَّ له رَبًّا يَغفِرُ الذَّنْبَ ويَأخُذُ به؟ غفَرْتُ لِعَبْدي»، أي: غفَرتُ له ذَنبَه؛ لأنَّه يَعلَمُ أنَّ له ربًّا يَغفِرُ الذَّنبَ وقادِرٌ على أن يُعاقِبَ به، والاستِفهامُ منَ اللهِ تَعالَى يَجوزُ أن يَكونَ للمُباهاةِ بين المَلائكةِ، ويَجوزُ أن يَكونَ استِفهامًا للتَّقريرِ والتَّعجيبِ، وإنَّما عَدَل عنِ الخِطابِ إلى الغَيبةِ شُكرًا منَ اللهِ لصَنيعِ عَبدِه، مع عِلمِه بما فَعَله العَبدُ. 
وهكذا تَكرَّر ذنبُ العبدِ ثَلاثَ مَرَّاتٍ، وفي كلِّ مرَّةٍ يَعودُ إلى اللهِ تَعالَى ويَطلُبُ منه المَغفِرةَ، حتَّى قالَ اللهُ له في المرَّةِ الأخيرةِ: «غفَرْتُ لِعَبْدي؛ ثَلاثًا»، أي: كرَّر الكَلِمةَ ثَلاثَ مرَّاتٍ، «فَلْيَعمَلْ ما شاءَ»، يعني: يَعمَلُ ما شاءَ ما دامَ كُلَّما أذنَبَ ذنبًا جَديدًا تابَ من ذنبِه واستَغفَرَ، لا أنَّه يُذنِبُ الذَّنبَ ثُمَّ يَعودُ إليه. 
وعِبارةُ: «فَلْيعَمَلْ ما شاءَ» تُستَعمَلُ تارةً في مَعرِضِ السَّخطةِ والنَّكيرِ، وتارةً في صورةِ التَّلطُّفِ والحَفاوةِ، وليس المُرادُ منه في كِلتا الصُّورَتَينِ الحَثَّ على الفِعلِ، أوِ التَّرَخُّصَ فيه. 
وقيل: اختِصاصُ هذا العَبدِ بهذه المَغفِرةِ؛ لأنَّه قد عَلِم أنَّه لا يُصِرُّ على ذَنبٍ، وأنَّه كُلَّما أذنَبَ تابَ، وهذا حُكمٌ يَعُمُّ كلَّ مَن كانت حالُه حالَه. 
وفي الحديثِ: عِظَمُ فائدةِ الاستغفارِ، وكَثرةُ فضلِ اللهِ، وسَعةُ رَحمتِه وحِلمِه وكرَمِه. 
وفيه: أنَّ التَّوبةَ الصَّحيحةَ لا يَضُرُّ فيها العَودةُ إلى الذَّنبِ ثانيًا، بل مَضَت على صِحَّتِها، ويَتوبُ منَ المَعصيةِ الثَّانيةِ. 
وفيه: بَيانُ أهَمِّيَّةِ العِلمِ الشَّرعيِّ الذي يَجعَلُ العَبدَ فاهِمًا لأُمورِ دينِه فيَتوبُ كُلَّما أخطَأ. 
مصدر شرح الحديث: الدّرر السّنيّة
`
global.had9 = `

عَنْ عَائشَة أُم المُؤمِنين رَضِيَ الله عَنْها قَالت:(أنَّ بَعْضَ أَزْوَاجِ النبيِّ صَلَّى اللهُ عليه وسلَّمَ، قُلْنَ للنبيِّ صَلَّى اللهُ عليه وسلَّمَ: أَيُّنَا أَسْرَعُ بكَ لُحُوقًا؟ قالَ: أَطْوَلُكُنَّ يَدًا، فأخَذُوا قَصَبَةً يَذْرَعُونَهَا، فَكَانَتْ سَوْدَةُ أَطْوَلَهُنَّ يَدًا، فَعَلِمْنَا بَعْدُ أنَّما كَانَتْ طُولَ يَدِهَا الصَّدَقَةُ، وكَانَتْ أَسْرَعَنَا لُحُوقًا به وكَانَتْ تُحِبُّ الصَّدَقَةَ.) 
المصدر : صحيح البخاري  
الصفحة أو الرقم : 1420  
————————— 
شرح الحديث:  
الصَّدقةُ مِن أفضَلِ الأعمالِ الَّتي يُقَدِّمُها الإنسانُ لنفْسِه، ويَنالُ أجْرَها العظيمَ عندَ الله سُبحانَه وتعالَى. 
وفي هذا الحديثِ تُخبِرُ أمُّ المؤمنينَ عائشةُ رَضيَ اللهُ عنها أنَّ بعضَ نساءِ النبيِّ صلَّى اللهُ عليه وسلَّمَ سَألَتْه أيُّهنَّ أسرَعُ مَوتًا بعْدَه؟ فأجابَهُنَّ بأنَّها أطْوَلُهنَّ يدًا، ففَهِموا هذا الأمْرَ على ظاهرِه فأخَذوا قَصَبةً مِن العِصيِّ لَيقدروا ذِراعَ كلِّ واحدةٍ مِنهُنَّ ويَقيسوه؛ كيْ يَعْلَمْنَ أيهُنَّ أطولُ يدًا مِن غيرِها؛ ظنًّا منهُنَّ أنَّ المرادَ طولُ اليدِ حَقيقةً، فكانتْ سَوْدةُ بنتُ زَمْعةَ رَضيَ اللهُ عنها أطولَهُنَّ يدًا، ثمَّ تبيَّنَ لهُنَّ بعْدَ مَوتِ زَينبَ بنتِ جَحشٍ رَضيَ اللهُ عنها مَقصدُه صلَّى اللهُ عليه وسلَّمَ بأطولِهنَّ يدًا، وهو أنَّه أكثرُهنَّ صَدقةً؛ وأراد بطُولِ يدِها كثرةَ إنفاقِها وصَدقاتِها، كما قالتْ عائشةُ رَضيَ اللهُ عنه في رِوايةِ مُسلِمٍ في صحيحِه: «فكانتْ أطْوَلَنا يدًا زَينبُ؛ لأنَّها كانت تَعملُ بيَدِها وتصَدَّقُ»، وكانتْ زَينبُ رَضيَ اللهُ عنها أوَّلَ مَن مات مِن زَوجاتِه بعْدَه صلَّى اللهُ عليه وسلَّمَ، وتُوفِّيَتْ رَضيَ اللهُ عنها في خِلافةِ عُمرَ بنِ الخطَّابِ رَضيَ اللهُ عنه، وبَقيَتْ سَوْدةُ إلى أن تُوفِّيَتْ في خِلافةِ مُعاويةَ، في شَوَّالٍ سنةَ أربعٍ وخمسينَ. 
وفي الحديثِ: فضلُ ومَنقَبةُ زينبَ بنتِ جَحشٍ رَضيَ اللهُ عنها. 
وفيه: دَلالةٌ على أنَّ الحُكمَ للمعاني لا للألفاظِ. 
وفيه: علَمٌ مِن أعلامِ النُّبوَّةِ. 
مصدر شرح الحديث: الدّرر السّنيّة
`
global.had10 = `

عَنْ عَائِشَةَ أُمُّ المُؤمِنينَ رَضيَ اللهُ عنها قالَتْ: كَأَنِّي أَنْظُرُ إلى وَبِيصِ الطِّيبِ في مَفَارِقِ رَسولِ اللَّهِ صلَّى اللهُ عليه وسلَّمَ وهو مُحْرِمٌ.) 
المصدر : صحيح البخاري 
الصفحة أو الرقم: 1538  
————————- 
شرح الحديث:  
بَيَّنَ النبيُّ صلَّى اللهُ عليه وسلَّمَ أحكامَ الحَجِّ والعُمرةِ وسُننَهما وآدابَهما، بالقولِ والفِعلِ، ونقَلَ الصَّحابةُ ما سَمِعوه وما رَأوْه مِنه صلَّى اللهُ عليه وسلَّمَ في ذلك. 
وقد كان صلَّى اللهُ عليه وسلَّمَ يُحِبُّ الطِّيبَ، ويَستكثِرُ منه في كلِّ حالٍ، وهو مِن الأُمورِ التي حُبِّبَت إليه مِن الدُّنيا.  
وفي هذا الحَديثِ تَرْوي عائِشةُ رَضيَ اللهُ عنها شِدَّةَ استِحضارِها لِلنبيِّ صلَّى اللهُ عليه وسلَّمَ وأفعالِه، فكَأنَّها تَنظُر الآنَ إلى أثَرِ الطِّيبِ وبَريقِه ولَمَعانِه في جَوانبِ رَأْسِ النبيِّ صلَّى اللهُ عليه وسلَّمَ وهو مُحْرِمٌ. وذلك كما في رِوايةِ الصَّحيحَينِ: أنَّ النبيَّ صلَّى اللهُ عليه وسلَّمَ إذا أرادَ أنْ يُحرِمَ تَطيَّبَ بأطيَبِ ما يَجِدُ. وهذا كِنايةٌ عن استِكْثارِ رَسولِ اللهِ صلَّى اللهُ عليه وسلَّمَ مِن هذا الطِّيبِ، وذلك قبْلَ أنْ يَلبَسَ ثِيابَ الإحْرامِ، وقبْلَ الشُّروعِ في الإحرامِ وقَبْلَ أن يُهِلَّ بالنُّسكِ، لا بعدَه.  
وفي الحديثِ: مَشروعيَّةُ التَّطيُّبِ قبْلَ الإحرامِ. 
مصدر شرح الحديث: الدّرر السّنيّة
`
global.had11 = `

عَن النُّعمان بِن بشير رَضِي الله عنه قَال : قَالَ رَسُولُ الله ﷺ:(إنَّ أهْوَنَ أهْلِ النَّارِ عَذابًا يَومَ القِيامَةِ، لَرَجُلٌ تُوضَعُ في أَخْمَصِ قَدَمَيْهِ جَمْرَةٌ، يَغْلِي مِنْها دِماغُهُ.) 
المصدر : صحيح البخاري  
الصفحة أو الرقم : 6561  
—————————- 
شرح الحديث: 
عَذابُ النَّارِ هو عقابُ اللهِ للمُذنِبينَ وأهلِ المعاصي والكُفَّارِ، وتختَلِفُ دَرَكاتُ الدَّاخِلينَ في جَهنَّمَ بحسَبِ سُوءِ أعمالِهم. 
وفي هذا الحَديثِ أشارَ رَسولُ اللهِ صلَّى اللهُ عليه وسلَّم إلى شِدَّةِ عَذابِ النَّارِ بذِكْرِ أقلِّ أهْلِها وأهْونِهم عَذابًا، والعِياذُ باللهِ! وهو رجُلٌ تُوضَعُ جَمْرَتَانِ -وهما قِطعتانِ مُلتَهِبتانِ مِنَ النَّارِ- في أَخْمَصِ قَدَمَيْهِ -وهو الفراغُ الذي لم يُصِبِ الأرضَ مِن باطِن الأقدامِ- فيَغْلِي مِن حَرِّهما دِماغُه، نَسأَلُ اللهَ السَّلامةَ والعافيةَ، وقِيلَ: إنَّ المرادَ بهذا العذابِ هو عَمُّ النَّبيِّ صلَّى اللهُ عليه وسلَّم أبو طَالِبٍ؛ لقوْلِه صلَّى اللهُ عليه وسلَّم وقدْ ذُكِر عندَه عَمُّه أبو طالِبٍ، فقال -كما في الصَّحيحينِ-: «لعَلَّه تَنفَعُه شَفاعتي يوْمَ القِيامةِ، فيُجعَلُ في ضَحْضَاحٍ مِن نارٍ يَبْلُغُ كَعْبَيْهِ، يَغلِي منه أُمُّ دِماغِه»، والحديثُ يَحتمِلُه وغيْرَه مِمَّن حالُه كحالِه. ويُفهَمُ من هذا أنَّ المرادَ مِن أهلِ النَّارِ مُلازِموها، وهم الكُفَّارُ، ولا يَشمَلُ مُرتَكِبي الكبائِرِ مِنَ المُؤمِنين؛ يدُلُّ لذلك ما رواه البُخاريُّ ومُسلمٌ: «أنَّ اللهَ يقولُ لأهوَنِ أهلِ النَّارِ أردتُ منك أهوَنَ مِن هذا؛ ألَّا تُشرِكَ بي شيئًا، فأَبيتَ إلَّا أن تُشرِكَ بي». 
وفي الحَديثِ: شِدَّةُ عَذابِ النَّارِ، سَلَّمنا اللهُ تعالَى منها. 
وفيه: أنَّ المُعَذَّبينَ به من الكُفَّارِ ليْسوا في دَرَجةٍ واحِدةٍ. 
وفيه: تحذيرٌ للعُصاةِ والكافِرينَ مِن هَولِ هذا العذابِ؛ لِيَبتَعِدوا عمَّا يؤدِّي إليه. 
مصدر شرح الحديث : الدّرر السّنيّة
`
global.had12 = `

عَن جَابِر بِنْ عَبدالله رَضِيَ الله عنه قَال:(بَعَثَنَا رَسولُ اللَّهِ صلَّى اللهُ عليه وسلَّمَ ثَلَاثَ مِئَةِ رَاكِبٍ أمِيرُنَا أبو عُبَيْدَةَ بنُ الجَرَّاحِ، نَرْصُدُ عِيرَ قُرَيْشٍ، فأقَمْنَا بالسَّاحِلِ نِصْفَ شَهْرٍ، فأصَابَنَا جُوعٌ شَدِيدٌ حتَّى أكَلْنَا الخَبَطَ، فَسُمِّيَ ذلكَ الجَيْشُ جَيْشَ الخَبَطِ، فألْقَى لَنَا البَحْرُ دَابَّةً يُقَالُ لَهَا: العَنْبَرُ، فأكَلْنَا منه نِصْفَ شَهْرٍ، وادَّهَنَّا مِن وَدَكِهِ حتَّى ثَابَتْ إلَيْنَا أجْسَامُنَا، فأخَذَ أبو عُبَيْدَةَ ضِلَعًا مِن أضْلَاعِهِ، فَنَصَبَهُ، فَعَمَدَ إلى أطْوَلِ رَجُلٍ معهُ [وفي رِوايةٍ]: ضِلَعًا مِن أضْلَاعِهِ فَنَصَبَهُ، وأَخَذَ رَجُلًا وبَعِيرًا- فَمَرَّ تَحْتَهُ. قالَ جَابِرٌ: وكانَ رَجُلٌ مِنَ القَوْمِ نَحَرَ ثَلَاثَ جَزَائِرَ، ثُمَّ نَحَرَ ثَلَاثَ جَزَائِرَ، ثُمَّ نَحَرَ ثَلَاثَ جَزَائِرَ، ثُمَّ إنَّ أبَا عُبَيْدَةَ نَهَاهُ. وكانَ عَمْرٌو يقولُ: أخْبَرَنَا أبو صَالِحٍ، أنَّ قَيْسَ بنَ سَعْدٍ قالَ لأبِيهِ: كُنْتُ في الجَيْشِ فَجَاعُوا، قالَ: انْحَرْ، قالَ: نَحَرْتُ، قالَ: ثُمَّ جَاعُوا، قالَ: انْحَرْ، قالَ: نَحَرْتُ، قالَ: ثُمَّ جَاعُوا، قالَ: انْحَرْ، قالَ: نَحَرْتُ، ثُمَّ جَاعُوا، قالَ: انْحَرْ، قالَ: نُهِيتُ.) 
المصدر : صحيح البخاري 
الصفحة أو الرقم: 4361  
———————- 
شرح الحديث:  
كان أصْحابُ النَّبيِّ صلَّى اللهُ عليه وسلَّمَ في جِهادٍ دائمٍ؛ فما يَخرُجونَ مِن غَزْوةٍ إلَّا ويَستَعِدُّونَ للَّتي بعْدَها، وتَحَمَّلوا الضُّرَّ والأذى في اللهِ، حتَّى فتَحَ اللهُ عليهمُ البُلدانَ، ودخَلَ النَّاسُ في دِينِ اللهِ أفْواجًا. 
وفي هذا الحَديثِ يَرْوي جابرُ بنُ عبدِ اللهِ رَضيَ اللهُ عنهما أنَّ رَسولَ اللهِ صلَّى اللهُ عليه وسلَّمَ بعَثَهم في سَريَّةٍ، وعدَدُهم ثَلاثُ مِئةِ راكبٍ، وجعَلَ أبا عُبَيْدةَ بنَ الجرَّاحِ رَضيَ اللهُ عنه أميرًا عليهم، ليَرصُدوا عِيرَ قُرَيشٍ، أي: ليَنتَظِروا ويُراقِبوا قافلةً مُحمَّلةً بمالِ التِّجارةِ لقُرَيشٍ، وأيضًا لمُحارَبةِ حيٍّ من جُهَيْنةَ، وكانت هذه السَّريَّةُ في العامِ الثَّامِنِ مِن الهِجْرةِ، وقد عُرِفَت بسَريَّةِ سَيفِ البَحرِ. 
ويُخبِرُ جابِرٌ رَضيَ اللهُ عنه أنَّهم أقاموا بسَّاحِلِ البحْرِ نِصفَ شَهرٍ، ففَنِيَ طَعامُهم، ونزَل بهم جُوعٌ شَديدٌ حتَّى أكَلوا «الخَبَطَ»، وهو ورَقُ السَّلَمِ؛ شَجرٌ مَعروفٌ، أو ما سقَطَ مِن وَرقِ الشَّجرِ بالخَبْطِ والنَّفضِ؛ فسُمِّيَ ذلك الجَيشُ جَيشَ الخَبَطِ مِن أجْلِ هذا. 
وبيْنَما همْ كذلك ألْقى إليهمُ البَحرُ دابَّةً مِن السَّمكِ يُقالُ لها: العَنبَرُ، وهو اسمٌ لنَوعٍ منَ الحيتانِ، يُتَّخَذُ مِن جِلدِها الأترَاسُ، وهو ما يُتَّقى به من ضَرَباتِ السَّيفِ، فأكَلوا مِن هذا الحوتِ نِصفَ شَهرٍ، وادَّهَنوا مِن «وَدَكِه»، أي: شَحْمِه، حتَّى رجَعَت أجْسامُهم إلى ما كانت عليه مِنَ القُوَّةِ والسِّمَنِ بعْدَما ضَعُفَت مِن الجوعِ. 
ويَصِفُ جابرٌ عِظَمَ الحُوتِ فيُخبِرُ أنَّه بعْدَ أنْ ظهَرَتْ عِظامُ الحوتِ وخلَتْ مِن اللَّحمِ، أخَذَ أبو عُبَيْدةَ رَضيَ اللهُ عنه ضِلَعًا مِن أضْلاعِه، فنصَبَه واقفًا، ثمَّ جاء بأطوَلِ رَجلٍ معَه، وهو قَيسُ بنُ سَعدِ بنِ عُبادةَ رَضيَ اللهُ عنهما، وفي رِوايةٍ: «أخَذَ رَجلًا وبَعيرًا، فمَرَّ تَحتَه راكبًا عليه»، وفي رِوايةِ الصَّحيحَينِ: «فلمَّا قَدِمْنا المَدينةَ، ذَكَرْنا ذلك للنَّبيِّ صلَّى اللهُ عليه وسلَّمَ، فقال: كُلوا؛ رِزقًا أخرَجَه اللهُ، أطْعِمونا إنْ كان معَكم، فأَتاهُ بَعضُهم، فأكَلَه». 
ويَحْكي جابِرٌ رَضيَ اللهُ عنه أنَّ رَجُلًا مِن القَومِ -وهو قَيسُ بنُ سَعدٍ- نحَرَ ثَلاثَ جَزائرَ، وذلك عندَما جاعوا، ثمَّ نحَرَ ثَلاثَ جَزائرَ أُخْرى، ثمَّ نحَرَ ثَلاثَ جَزائرَ أُخْرى، والجَزائرُ جَمعُ جَزورٍ، وهو البَعيرُ ذَكرًا كان أو أُنْثى، وكانتْ تِلك الجِمالُ من دَوابِّهمُ الَّتي كانتْ تَحمِلُهم، ثمَّ إنَّ أبا عُبَيْدةَ رَضيَ اللهُ عنه نَهاهُ عن ذلك؛ لأجْلِ قلَّةِ الظَّهرِ. ولَمَّا رجَعَ قَيسُ بنُ سَعدٍ لأبيهِ سَعدِ بنِ عُبادةَ رَضيَ اللهُ عنهما، حَكَى له أنَّهم جاعُوا ثَلاثَ مرَّاتٍ وهمْ في الجَيشِ، وفي كلِّ مرَّةٍ يقولُ له أبوهُ: «انْحَرْ»، أي: وأطْعِمْهم، ويرُدُّ عليه ابنُه أنْ قدْ نَحَرْنا حتَّى جاءَتِ الرَّابعةُ، وقدْ جاعوا، فنَهاه أبو عُبَيْدةَ رَضيَ اللهُ عنه عن ذلك. قيل: إنَّ عُمَرَ بنَ الخطَّابِ رَضيَ اللهُ عنه كان في ذلك الجيشِ، فلمَّا رَأى ذلك طَلَبَ مِن أبي عُبيدةَ أنْ يَنهى قَيسًا عن النَّحْرِ، فعَزَمَ عليه أبو عُبَيدةَ أنْ يَنتهِيَ عن ذلك، فأطاعَه. 
وفي الحَديثِ: ما كان عليه الصَّحابةُ رَضيَ اللهُ عنهم مِنَ الجُوعِ، وشِدَّةِ العَيشِ في أوَّلِ الإسلامِ. 
وفيه: فَضلُ أبي عُبَيْدةَ بنِ الجرَّاحِ رَضيَ اللهُ عنه، وحِكمَتُه في قِيادةِ الجَيشِ.وفيه: مَشْروعيَّةُ أكْلِ مَيْتةِ البَحرِ. 
مصدر شرح الحديث: الدّرر السّنيّة
`
global.had13 = `

عَن حُذيفة بِن اليَمان رَضِيَ الله عنه قَال: (  
كانَ النبيُّ صَلَّى اللهُ عليه وسلَّمَ إذَا قَامَ مِنَ اللَّيْلِ، يَشُوصُ فَاهُ بالسِّوَاكِ.) 
المصدر : صحيح البخاري 
الصفحة أو الرقم: 245  
—————— 
شرح الحديث:  
السِّواكُ عودٌ يُقطَعُ من شَجرةِ الأَراكِ، ويُستَخدَمُ في تَنظيفِ الفَمِ والأسنانِ، ويُطيِّبُ الفَمَ، ويُزيلُ الرَّوائحَ الكَريهةَ، وهو مِن آكِدِ السُّننِ عَنِ النبيِّ صلَّى اللهُ عليه وسلَّمَ، فكانَ كثيرًا ما يَستاكُ ويَأمُرُ بِالسِّواكِ، وهو يَتأكَّدُ في بعضِ الأوقاتِ دُونَ غيرِها، منها ما في هذا الحديثِ، وهو قِيامُ اللَّيلِ، فيَروي حُذَيفةُ بنُ اليَمانِ رَضيَ اللهُ عنه أنَّه صلَّى اللهُ عليه وسلَّمَ كان إذا أرادَ أنَ يَقومَ إلى صَلاةِ اللَّيلِ والتَّهجُّدِ يَشوصُ فاه بِالسِّواكِ، أي: يُمِرُّه على أسنانِه ويَدْلُكُها به؛ وذلك لِتَطهيرِ رائحةِ الفمِ؛ لقِراءةِ القرآنِ والدُّعاءِ في الصَّلاةِ.وفي الحديث: بَيانُ فَضيلةِ السِّواكِ وأهمِّيَّتِه. 
مصدر شرح الحديث: الدّرر السّنيّة
`
global.had14 = `

عَن أَبِي هُرَيرةَ رَضِيَ الله عنهُ قال : قالَ رَسُول الله ﷺ:  
(كُلُّ عَمَلِ ابْنِ آدَمَ يُضَاعَفُ، الحَسَنَةُ عَشْرُ أَمْثَالِهَا، إلى سَبْع مِائَة ضِعْفٍ، قالَ اللَّهُ عَزَّ وَجَلَّ: إلَّا الصَّوْمَ؛ فإنَّه لي، وَأَنَا أَجْزِي به، يَدَعُ شَهْوَتَهُ وَطَعَامَهُ مِن أَجْلِي. لِلصَّائِمِ فَرْحَتَانِ: فَرْحَةٌ عِنْدَ فِطْرِهِ، وَفَرْحَةٌ عِنْدَ لِقَاءِ رَبِّهِ. وَلَخُلُوفُ فيه أَطْيَبُ عِنْدَ اللهِ مِن رِيحِ المِسْكِ.) 
المصدر : صحيح مسلم  
الصفحة أو الرقم : 1151  
————————- 
شرح الحديث :  
الصِّيامُ مِن أحَبِّ العباداتِ إلى اللهِ، وأجَلِّ القُرُباتِ الَّتي يَتقرَّبُ بها العبدُ لرَبِّهِ عزَّ وجلَّ؛ ولذلك فإنَّ أجرَهُ كَبيرٌ، وفَضْلَهُ عَظيمٌ، وكَرامةُ اللهِ للصَّائمينَ لا تَنقطِعُ؛ فإنَّهم حَرَمُوا أنْفُسَهم الطَّعامَ والشَّرابَ والشَّهوةَ، فأَعْطاهمُ اللهُ سُبحانَه وتعالَى مِن واسِعِ عَطائِه، وفضَّلَهم على غَيرِهم. 
وفي هذا الحَديثِ يُخبِرُنا النَّبيُّ صلَّى اللهُ عليه وسلَّمَ أنَّ كُلَّ شَيءٍ يَعمَلُهُ الإنْسانُ المسلِمُ مِن وُجوهِ الخيرِ والبِرِّ والطَّاعةِ، يُضاعَفُ أجْرُه وثَوابُه، فتكونُ الحَسنةُ فيهِ بعَشرِ أمْثالِها، إلى سَبْعِ مِائةِ ضِعْفٍ، كما في قولِ اللهِ تعالى: {مَنْ جَاءَ بِالْحَسَنَةِ فَلَهُ عَشْرُ أَمْثَالِهَا} [الأنعام: 160]، وقولِه عزَّ وجلَّ: {مَثَلُ الَّذِينَ يُنْفِقُونَ أَمْوَالَهُمْ فِي سَبِيلِ اللَّهِ كَمَثَلِ حَبَّةٍ أَنْبَتَتْ سَبْعَ سَنَابِلَ فِي كُلِّ سُنْبُلَةٍ مِائَةُ حَبَّةٍ وَاللَّهُ يُضَاعِفُ لِمَنْ يَشَاءُ وَاللَّهُ وَاسِعٌ عَلِيمٌ} [البقرة: 261]. 
ثُمَّ أخبَرَ النَّبيُّ صلَّى اللهُ عليه وسلَّمَ أنَّ اللهَ عزَّ وجلَّ قال: «إلَّا الصَّومَ؛ فإنَّه لي»، أي: إنَّ الصَّومَ مُسْتَثنًى مِن هذه الأعْمالِ الَّتي تَتضاعَفُ فيها الحَسَناتُ، بلْ ثَوابُ الصَّومِ لا يَقْدِرُ قَدْرَه إلَّا اللهُ تعالَى؛ ذلك لأنَّ الصَّومَ سِرٌّ بيْنَ العبدِ ورَبِّهِ، «وأنا أَجْزي به»، أي: إنَّ اللهَ تعالى هو الَّذي يَتولَّى ذلك الأجرَ والثَّوابَ، فثَوابُ الصِّيامِ لا يُحْصِيه إلَّا اللهُ تعالَى، ولم يَكِلْه تعالَى إلى مَلائكتِه، بلْ تَولَّى جَزاءَه تعالَى بنفْسِه، واللهُ تعالَى إذا تَولَّى شَيئًا بنفْسِه دلَّ على عِظَمِ هذا الثَّوابِ وذلك الأجْرِ؛ ذلك أنَّ العبدَ الصَّائمَ يَترُكُ ما تَشتَهِيه نَفْسُه وما أباحَه اللهُ سُبحانَه له مِن مَلَذَّاتِ الطَّعامِ والشَّرابِ والجِماعِ، طاعةً للهِ عزَّ وجلَّ، وطَمَعًا في نَيْلِ محبَّتِه ورِضاه. 
ثُمَّ أخبَرَ النَّبيُّ صلَّى اللهُ عليه وسلَّمَ أنَّ الصَّائِمَ يَفرَحُ مرَّتينِ؛ الفَرحةُ الأُولى: «فَرْحةٌ عِندَ فِطْرِهِ»، وهذه الفَرحةُ تكونُ في الدُّنيا، عِندَ انْتهاءِ صَومِهِ وإفْطارِهِ، وإتْمامِهِ العِبادةَ راجيًا مِنَ اللهِ الثَّوابَ والفضلَ، والفَرحةُ الثَّانيةُ تكونُ عِندَ مَوْتِهِ، حيث يَنالُ الأجرَ والثَّوابَ. 
ثُمَّ أقسَمَ النَّبيُّ صلَّى اللهُ عليه وسلَّمَ أنَّ خُلوفَ فَمِ الصَّائمِ -والخُلوفُ هو ما يُخَلَّفُ بعْدَ الطَّعامِ في فَمِ الصَّائِمِ مِن رائِحةٍ كَريهةٍ بِخِلافِ المُعْتادِ- «أَطْيَبُ»، أي: أفضَلُ عندَ اللهِ مِن رائحةِ المِسكِ، وقدِ اخْتُلِفَ في كَوْنِ الخُلوفِ أطْيَبَ عِندَ اللهِ مِن رِيحِ المِسكِ، على أنَّ المَعنى أنَّه أطْيَبُ عِندَ اللهِ مِن رِيحِ المِسكِ عِندَكم، أو أنَّ اللهَ تعالَى يَجْزيه في الآخِرةِ حتَّى تكونَ رائحتُهُ أطيَبَ مِن رِيحِ المِسكِ، أو أنَّ صاحِبَ الخُلوفِ يَنالُ مِنَ الثَّوابِ ما هو أفضلُ مِن رِيحِ المسكِ، أو أنَّ الخُلوفَ أكثَرُ ثَوابًا مِنَ المِسكِ حيث نُدِبَ إليه في الجُمَعِ والأعيادِ، أو أنَّ الملائكةَ يَسْتَطيبونَ رِيحَ الخُلوفِ أكثَرَ ممَّا يَسْتَطيبونَ رِيحَ المِسكِ. 
وفي الحَديثِ: بَيانُ أَجْرِ وفضْلِ الصَّومِ. 
مصدر شرح الحديث: الدّرر السّنيّة
`

let file = require.resolve(__filename)
fs.watchFile(file, () => {
	fs.unwatchFile(file)
	console.log(chalk.redBright(`Update'${__filename}'`))
	delete require.cache[file]
	require(file)
})
